001900 01  ORRORL-LINE-REQUEST.
002000     05  ORRORL-REQUEST-FUNCTION        PIC X(02).
002100         88  ORRORL-CREATE-ORDER-LINE               VALUE 'OL'.
002200     05  ORRORL-SS-END-USER-BR          PIC X(02).
002300     05  ORRORL-SS-END-USER-NBR         PIC X(06).
002400     05  ORRORL-CUST-TO-ING-PO-NBR      PIC X(18).
002500     05  ORRORL-CUST-LINE-NBR           PIC X(03).
002600     05  ORRORL-ING-LINE-NBR            PIC X(03).
002700     05  ORRORL-CUST-PART-NBR           PIC X(12).
002800     05  ORRORL-ING-PART-NBR            PIC X(12).
002900*    05  ORRORL-QTY-ORDERED             PIC X(04).
003000     05  ORRORL-QTY-ORDERED             PIC X(07).                ROR09085
003100     05  ORRORL-NEW-WAREHSE-NBR         PIC X(02).
003200     05  ORRORL-NEW-BILL-TO-SUFFIX      PIC X(03).
003300     05  ORRORL-PULL-RSV-INV-FLAG       PIC X(01).
003400     05  ORRORL-RSV-SEQUENCE-NBR        PIC X(02).
003500     05  ORRORL-RSV-TYPE-CODE           PIC X(01).
003600     05  ORRORL-END-USER-PRICE          PIC 9(13)V9(4).
003700     05  ORRORL-CUST-INTERNAL-SALESMAN  PIC X(04).
003800     05  ORRORL-CUST-INTERNAL-ACCTINFO  PIC X(05).
003900     05  ORRORL-EU-ID-ADDR-CTAC.
004000         10  ORRORL-END-USER-ID         PIC 9(09).
004100         10  ORRORL-ADDR-SEQ-NBR        PIC 9(09).
004200         10  ORRORL-CTAC-ID             PIC 9(09).
004300     05  ORRORL-GOVT-EU-PO-NBR          PIC X(20).
004400     05  ORRORL-MKT-SEGMENT-TYPE        PIC X(01).
004500     05  ORRORL-EU-DATA-AVAIL-SW        PIC X(01).
004600     05  ORRORL-AUTH-BID-NBR            PIC X(20).
004700     05  ORRORL-UNIT-PRICE              PIC 9(13)V9(4).
004800     05  ORRORL-RESELLER-BASE-PRICE     PIC 9(13)V9(4).
004900     05  ORRORL-LINE-TYPE               PIC X(01).
005000         88  ORRORL-BILL-ONLY-LINE      VALUE 'N'.
005100     05  ORRORL-PROMISE-DATE            PIC X(08).
005200     05  ORRORL-ORIGINAL-PRICE          PIC 9(13)V9(04).
005300     05  ORRORL-BR-TAX-DISC-SW          PIC X(01).                ROR06194
005400     05  ORRORL-SPEC-BID-LINE-IND       PIC X(01).                ROR08057
005500     05  ORRORL-SPEC-BID-NBR            PIC X(35).                ROR08057
005600     05  ORRORL-NEW-WAREHSE-CO          PIC X(02).                ROR09189
005700     05  ORRORL-GSN                     PIC X(14).                PKV09266
005800*      TILL EAI TEAM ADDS THESE....                               ROR15289
005900     05  ORRORL-PROD-MDL-NUMBER         PIC X(12).                ROR15289
006000     05  ORRORL-LCNSG-SRV-NUMBER        PIC X(20).                ROR15289
006100     05  ORRORL-OPEN-WAREHOUSE-SEQ-FLAG PIC X(01).                DXB16281
006200         88  ORRORL-USE-OPEN-WAREHOUSE-SEQ          VALUE 'Y'.    DXB16281
006300     05  ORRORL-CUST-GIFT-CODE          PIC X(10).                VXA17097
006400     05  ORRORL-AUC-SEL-COST            PIC 9(13)V9(4).           FXS17203
           05  ORRORL-OVERRIDE-TAX-AMT        PIC 9(15)V9(2).           SS125318
006600     05  ORRORL-DESC1                   PIC X(35).                FXS17203
006700     05  ORRORL-DESC2                   PIC X(35).                FXS17203
006800     05  ORRORL-AUTH-ACOP-TRK-NBR       PIC X(09).                TEH17279
006900     05  ORRORL-GSA-FLAG                PIC X(01).                TEH17279
007000     05  ORRORL-VENDOR-NBR              PIC X(04).                TEH17279
007100     05  ORRORL-CNFG-LINE-INFO-SW       PIC X(01).                NXC17279
007200         88  ORRORL-CNFG-LINE-INFO                  VALUE 'Y'.    NXC17279
007300         88  ORRORL-CNFG-LINE-INSERTED              VALUE 'I'.    NXC17279
007400         88  ORRORL-CNFG-LINE-MODIFIED              VALUE 'M'.    NXC17279
007500         88  ORRORL-NO-CNFG-LINE-INFO               VALUE 'N'.    NXC17279
           05  ORRORL-VSN                     PIC X(14).                NXC18292
           05  ORRORL-HW-WAR-CUST-LNE-NBR-1   PIC X(03).                NXC19165
           05  ORRORL-HW-WAR-CUST-LNE-NBR-2   PIC X(03).                NXC19165
           05  ORRORL-HW-WAR-CUST-LNE-NBR-3   PIC X(03).                NXC19165
           05  ORRORL-HW-WAR-CUST-LNE-NBR-4   PIC X(03).                NXC19165
           05  ORRORL-SS-END-USER-DETAIL.
               10  ORRORL-SS-END-USER-EMAIL     PIC X(100).             VXA19256
               10  ORRORL-SS-END-USER-CTAC-PHNE PIC X(15).              VXA19256
           05  ORRORL-UNIT-PRICE-OVRD-IND     PIC X(01).                CDL20031
           05  ORRORL-UNIT-PRICE-SW           PIC X(01).                CDL20031
           05  ORRORL-GDS-SVCS-DOP            PIC X(10).                ROR20031
           05  ORRORL-ENTITLED-P-NAME         PIC X(60).                ROR20031
           05  ORRORL-ENTITLED-P-ADDR1        PIC X(50).                ROR20031
           05  ORRORL-ENTITLED-P-ADDR2        PIC X(50).                ROR20031
           05  ORRORL-ENTITLED-P-CITY         PIC X(21).                ROR20031
           05  ORRORL-ENTITLED-P-STATE        PIC X(02).                ROR20031
           05  ORRORL-ENTITLED-P-ZIP          PIC X(10).                ROR20031
           05  ORRORL-ENTITLED-P-CNTRY        PIC X(02).                ROR20031
           05  ORRORL-ENTITLED-EMAIL-ADDR     PIC X(95).                ROR20031
           05  ORRORL-ENTITLED-EMAIL-IND      PIC X(01).                ROR20031
           05  ORRORL-ENTITLED-P-PHONE        PIC X(13).                ROR20031
           05  ORRORL-ASSET-P-NAME            PIC X(60).                ROR20031
           05  ORRORL-ASSET-P-ADDR1           PIC X(50).                ROR20031
           05  ORRORL-ASSET-P-ADDR2           PIC X(50).                ROR20031
           05  ORRORL-ASSET-P-CITY            PIC X(21).                ROR20031
           05  ORRORL-ASSET-P-STATE           PIC X(02).                ROR20031
           05  ORRORL-ASSET-P-ZIP             PIC X(10).                ROR20031
           05  ORRORL-ASSET-P-CNTRY           PIC X(02).                ROR20031
           05  ORRORL-ASSET-EMAIL-ADDR        PIC X(95).                ROR20031
           05  ORRORL-ASSET-EMAIL-IND         PIC X(1).                 ROR20031
           05  ORRORL-ASSET-P-PHONE           PIC X(13).                ROR20031
           05  ORRORL-UCID                    PIC X(40).                ROR20031
           05  ORRORL-LOID                    PIC X(18).                ROR20031
           05  ORRORL-ENTITLED-CTC-NAME       PIC X(60).                ROR20031
           05  ORRORL-ASSET-CTC-NAME          PIC X(60).                ROR20031
           05  ORRORL-SYS-MGR-CTC             PIC X(60).                ROR20031
           05  ORRORL-API-VERIFY-IND          PIC X(01).                NXC20067
               88  ORRORL-API-VRFY-SUCCESS                VALUE 'Y'.    NXC20067
               88  ORRORL-API-VRFY-ERROR                  VALUE 'E'.    NXC20067
               88  ORRORL-API-NOT-VERIFIED                VALUE 'N'.    NXC20067
               88  ORRORL-API-VRFY-NOT-REQD               VALUE ' '.    NXC20067
           05  ORRORL-SS-EU-CO-NAM            PIC X(60).                NXC20067
           05  ORRORL-SS-EU-CO-ADDR-1         PIC X(50).                NXC20067
           05  ORRORL-SS-EU-CO-ADDR-2         PIC X(50).                NXC20067
           05  ORRORL-SS-EU-CO-CITY           PIC X(40).                NXC20067
           05  ORRORL-SS-EU-CO-ST-PVNC-CD     PIC X(03).                NXC20067
           05  ORRORL-SS-EU-POST-CD           PIC X(10).                NXC20067
           05  ORRORL-SS-EU-CTRY-CD           PIC X(02).                NXC20067
           05  ORRORL-SS-EU-CTAC-NAM          PIC X(60).                NXC20067
           05  ORRORL-ORIGINAL-RSLR-PRICE     PIC 9(13)V9(4).           NXC20067
           05  ORRORL-ICMS-CODE               PIC X(02).                NXC20067
           05  ORRORL-TES-CODE                PIC X(03).                ROR20158
           05  ORRORL-HB-DEAL-SEQ-NO          PIC X(10).                ROR20158
           05  ORRORL-VAT-CODE                PIC X(02).                VYP20193
           05  ORRORL-DSLINK-UNIQUE-ID        PIC X(24).                TXT22084
           05  ORRORL-VEND-ACOP-PGM-CD        PIC X(02).                TZM22155
           05  ORRORL-EU-PURCH-DATE           PIC X(08).                CDL23049
           05  ORRORL-EU-PRICE                PIC 9(13)V9(4).           CDL23049
           05  ORRORL-COST-OVERRIDE-IND       PIC X(01).                SXT23049
               88 ORRORL-COST-OVERRIDE-GDS                VALUE 'G'.    SXT23049
               88 ORRORL-COST-OVERRIDE-ACOP-MAX           VALUE 'T'.    DXB23202
           05  ORRORL-GDS-TRK-NBR-DATA.                                 SXT23049
               10 ORRORL-GDS-AUTH-TRK-NBR     PIC 9(18).                SXT23049
               10 ORRORL-GDS-TIER-TRK-NBR     PIC 9(18).                SXT23049
           05  ORRORL-SPLIT-LINE-FLAG         PIC X(01).                DXB24111
      *BELOW FIELDS IS FOR NBO-ACOP TO KEEP ORDER ON EA HOLD            KXA24187
           05  ORRORL-NBO-ACOP-HOLD-REC.                                KXA24187
             10 ORRORL-NBO-ACOP-HOLD           PIC X(01).               KXA24187
                 88  ORRORL-NBO-ACOP-HOLD-YES          VALUE 'Y'.       KXA24187
                 88  ORRORL-NBO-ACOP-HOLD-NO           VALUE 'N'.       KXA24187
      *BELOW FIELDS IS FOR ORDERS IF TO PUT ON EA HOLD IF THERE IS      KXA24187
      *REBATE ADDED TO THE LINE                                         KXA24187
           05  ORRORL-ORDR-HOLD-IND.                                    KXA24187
             10 ORRORL-ORDR-HOLD-IND-SW        PIC X(01).               KXA24187
                 88  ORRORL-ORDR-HOLD-YES              VALUE 'Y'.       KXA24187
                 88  ORRORL-ORDR-HOLD-NO               VALUE 'N'.       KXA24187
           05  ORRORL-CONTRACT-START-DT       PIC X(08).                AXZ24292
           05  ORRORL-CONTRACT-END-DT         PIC X(08).                AXZ24292
      *FIELDS TO SUPPORT CISCO - CCW-R DESCRIPTION                      KXS25010
           05  ORRORL-CISCO-CCWR-FIELDS.                                KXS25010
               10 ORRORL-PRICE-PROT-DATE      PIC X(08).                KXS25010
               10 ORRORL-TERM-START-DATE      PIC X(08).                KXS25010
               10 ORRORL-TERM-END-DATE        PIC X(08).                KXS25010
               10 ORRORL-TERM-DURATION        PIC X(03).                KXS25010
               10 ORRORL-NP-MAGIC-KEY         PIC X(19).                KXS25010
               10 ORRORL-NP-VEND-LINE-NBR     PIC X(10).                KXS25010
               10 ORRORL-DART-COMMENT         PIC X(20).                KXS25010
           05  ORRORL-VND-VMF-LNE-INF-MISS-SW PIC X(01).                VZM25318
               88 ORRORL-VND-VMF-LNE-INFO-MISS     VALUE 'Y'.           VZM25318
               88 ORRORL-VND-VMF-LNE-INFO-OK       VALUE 'N'.           VZM25318
               88 ORRORL-VND-VMF-LNE-INFO-NO-ACT   VALUE ' '.           VZM25318
           05  ORRORL-BRAZIL-CHILD-SKU-IND    PIC X(01).                SS125318
           05  ORRORL-OVERRIDE-TAX-AMT-SIGN   PIC X(01).                SS125318
               88 ORRORL-POSITIVE-TAX-AMT     VALUE ' ' 'Y'.            SS125318
               88 ORRORL-NEGATIVE-TAX-AMT     VALUE 'N'.                SS125318
           05  ORRORL-RSLR-TOTAL-TAX          PIC 9(15)V9(2).           SS125318
           05  ORRORL-VND-VMF-LNE-INF-SENT-SW PIC X(01).                VZM25346
               88 ORRORL-VND-VMF-LNE-INF-SENT      VALUE 'Y'.           VZM25346
      *                                                                 KXS25010
           05  ORRORL-FILLER-AREA             PIC X(022).               VZM25346