       01  ORRORC-COMMENT-LINE-REQUEST.
           05  ORRORC-REQUEST-FUNCTION             PIC X(02).
               88  ORRORC-CREATE-COMMENT-LINE              VALUE 'CL'.
           05  ORRORC-RECORD-ID                    PIC X(03).
               88  ORRORC-CONFIGURATION-COMMENT            VALUE 'CFG'.
               88  ORRORC-ORDER-COMMENT                    VALUE 'ORC'.
               88  ORRORC-DYNAMIC-MESSAGE                  VALUE 'PER'.
               88  ORRORC-ADDITIONAL-DESCRIPT              VALUE 'DES'.
           05  ORRORC-INGRAM-ORDER.
               10  ORRORC-INGRAM-ORDER-BR          PIC X(02).
               10  ORRORC-INGRAM-ORDER-NBR         PIC X(05).
               10  ORRORC-INGRAM-ORDER-SUFFIX.
                   15  ORRORC-INGRAM-ORDER-DIST    PIC X(01).
                   15  ORRORC-INGRAM-ORDER-SHIP    PIC X(01).
           05  ORRORC-CUSTOMER-TO-INGRAM-PO        PIC X(20).
           05  ORRORC-CUSTOMER-LINE-NBR            PIC X(03).
           05  ORRORC-COMMENT                      PIC X(35).
           05  ORRORC-INGRAM-LINE-NBR              PIC X(03).
           05  ORRORC-INGRAM-PART-NBR              PIC X(12).
           05  ORRORC-SHIP-FROM-BRANCH-NBR         PIC X(02).
      *    05  ORRORC-COMMENT-IND                  PIC X(02).           NXC20067
           05  ORRORC-PRIM-SKU-SRL-NBR             PIC X(30).           NXC20067
           05  ORRORC-PRIM-SKU-PUR-DATE            PIC X(10).           NXC20067
           05  ORRORC-PRIM-SKU-SHP-DATE            PIC X(10).           NXC20067
           05  ORRORC-SERIAL-TYPE-IND              PIC X(01).           NXC20067
               88  ORRORC-PRIMARY-SRL                      VALUE 'P'.   NXC20067
               88  ORRORC-SECONDARY-SRL                    VALUE 'S'.   NXC20067
               88  ORRORC-DEFAULT-SRL                      VALUE ' '.   NXC20067
           05  ORRORC-API-VERIFY-IND               PIC X(01).           NXC20067
               88 ORRORC-API-VRFY-SUCCESS                  VALUE 'Y'.   NXC20067
               88 ORRORC-API-VRFY-ERROR                    VALUE 'E'.   NXC20067
               88 ORRORC-API-NOT-VERIFIED                  VALUE 'N'.   NXC20067
               88 ORRORC-API-VRFY-NOT-REQD                 VALUE ' '.   NXC20067
           05  ORRORC-DESC-LINE-NBR                PIC X(03).           ROR20158
               88  ORRORC-NP-TERM-INFO                     VALUE '598'. ROR20158
               88  ORRORC-NP-MK-INFO                       VALUE '599'. ROR20158
           05  ORRORC-HW-LINKED-ORDER-NBR          PIC X(11).           BYA23153
           05  ORRORC-HW-LINKED-LN-NBR             PIC X(03).           BYA23153
           05  ORRORC-HW-LINKED-SKU                PIC X(12).           BYA23153
           05  FILLER                              PIC X(039).          BYA23153
