002300 01  ORRORH-ORDER-REQUEST.
002400     05  ORRORH-REQUEST-FUNCTION         PIC X(02).
002500         88  ORRORH-CREATE-ORDER                    VALUE 'OR'.
002600* THE NEXT 2 FIELDS BECOME THE RESELLER IF THE SS-EU ARE POPULATED
002700     05  ORRORH-CUSTOMER-BR              PIC X(02).
002800     05  ORRORH-CUSTOMER-NBR             PIC X(06).
002900     05  ORRORH-COUNTRY-CODE             PIC X(02).
003000* THE NEXT 2 FIELDS BECOME THE CUSTOMER IF THEY ARE POPULATED
003100     05  ORRORH-SS-EU-BR                 PIC X(02).
003200     05  ORRORH-SS-EU-CUST               PIC X(06).
003300     05  ORRORH-CUST-TO-ING-PO-NBR       PIC X(18).
003400     05  ORRORH-CUST-TO-CUST-PO-NBR      PIC X(18).
003500* THE SUFFIX FIELD IS USED ALSO FOR SS END USER SUFFIX
003600     05  ORRORH-BILL-TO-SUFFIX           PIC X(03).
003700     05  ORRORH-BCK-BACKORDER-FLAG       PIC X(01).
003800         88 ORRORH-BCK-VALID-BO-FLAG     VALUE 'Y' 'N' 'C' 'P'    ROR10293
003900                                               'E' 'B'.           ROR10293
004000         88 ORRORH-BCK-ALLOW-BACKORDERS             VALUE 'Y'.
004100         88 ORRORH-BCK-NO-BACKORDERS                VALUE 'N'.
004200         88 ORRORH-BCK-SHIP-COMPLETE     VALUE 'C' 'E' 'B'.       ROR10293
004300         88 ORRORH-BCK-SHIP-CONSOLIDATED            VALUE 'B'.    ROR10293
004400         88 ORRORH-BCK-FILL-COMPLETE                VALUE 'P'.
004500     05  ORRORH-SS-SPLIT-SHIP-FLAG       PIC X(01).
004600         88 ORRORH-SS-SPLIT-SHIP-VALID         VALUE 'Y', 'N'.
004700         88 ORRORH-SS-SPLIT-ORDER                   VALUE 'Y'.
004800         88 ORRORH-SS-DO-NOT-SPLIT-ORDER            VALUE 'N'.
004900* MODIFIED BELOW ADDRESS FIELDS AND ADDED NEW FIELDS TO           PKV09266
005000*    ACCOMODATE ASIA-PACIFIC COUNTRIES  (CHINA - 2BYTE CHARS)     PKV09266
      * REUSING THE ADDRESS-4 FIELD FOR CHINA SSEU IMPLEMENTATION       VXA21261
005100     05  ORRORH-SHIP-TO-ATTN             PIC X(70).               PKV09266
005200     05  ORRORH-SHIP-TO-NAME             PIC X(70).               PKV09266
005300     05  ORRORH-SHIP-TO-ADDRESS-1        PIC X(70).               PKV09266
005400     05  ORRORH-SHIP-TO-ADDRESS-2        PIC X(70).               PKV09266
005500     05  ORRORH-SHIP-TO-ADDRESS-3        PIC X(70).               PKV09266
           05  ORRORH-SHIP-TO-PROVINCE         PIC X(70).               VXA21261
005700     05  ORRORH-SHIP-TO-ADDRESS-5.                                PKV09266
005800         15 ORRORH-SHIP-TO-PHONE           PIC X(15).             PKV09266
005900         15 ORRORH-SHIP-TO-FAX             PIC X(15).             PKV09266
006000         15 ORRORH-SHIP-TO-MOBILE          PIC X(15).             PKV09266
006100         15 ORRORH-SHIP-TO-ZIP             PIC X(09).             PKV09266
006200         15 ORRORH-SHIP-TO-CNTRY-CODE      PIC X(10).             PKV09266
006300         15 ORRORH-SHIP-TO-FILLER-2BY      PIC X(06).             PKV09266
006400     05  ORRORH-SHIP-TO-CITY             PIC X(21).               PKV09266
006500     05  ORRORH-SHIP-TO-STATE            PIC X(02).               PKV09266
006600     05  ORRORH-SHIP-VIA-CARRIER-CODE    PIC X(02).
006700     05  ORRORH-SHIP-TO-SUFFIX           PIC X(03).
006800     05  ORRORH-THIRD-PARTY-FRT-ACCOUNT  PIC X(12).
006900     05  ORRORH-END-CUST-ID              PIC X(25).
007000     05  ORRORH-END-CUST-NUM             PIC X(10).
007100*        ORRORH-ORDER-ENTRY-METHOD IS ALSO TERM-ID.
007200     05  ORRORH-ORDER-ENTRY-METHOD       PIC X(04).
007300     05  ORRORH-OPER-ID                  PIC X(04).
007400     05  ORRORH-GOVT-PROGRAM-TYPE        PIC X(02).
007500     05  ORRORH-GOVT-END-USER-TYPE       PIC X(02).
007600     05  ORRORH-GOVT-SOLICITATION-NBR    PIC X(14).
007700     05  ORRORH-GOVT-END-USER-DATA       PIC X(25).
007800     05  ORRORH-GOVT-END-USER-ZIP        PIC X(09).
007900     05  ORRORH-GOVT-PUBLIC-PRIVATE-SW   PIC X(01).
008000         88  ORRORH-PUBLIC-ORDER                    VALUE 'P'.
008100         88  ORRORH-PRIVATE-ORDER                   VALUE 'R'.
008200     05  ORRORH-ADDRESS-OVERRIDE-FLAG    PIC X(01).
008300     05  ORRORH-PROMISE-DATE             PIC  X(08).
008400     05  ORRORH-DIRECT-SHIP              PIC  X(01).
008500     05  ORRORH-CUST-INTERNAL-SALESMAN   PIC X(04).
008600     05  ORRORH-CUST-INTERNAL-ACCTINFO   PIC X(05).
008700     05  ORRORH-COD-TERMS-FLAG           PIC X(01).
008800     05  ORRORH-SS-RESELLER-SUFFIX       PIC X(03).
008900     05  ORRORH-TERMS                    PIC X(03).
009000     05  ORRORH-EMAIL-ADDRESS            PIC X(50).
009100     05  ORRORH-FREIGHT-FORWARDER        PIC X(03).
009200     05  ORRORH-FRT-OUT-CODE             PIC X(01).
009300     05  ORRORH-OS-SALESMAN              PIC X(04).
009400     05  ORRORH-SPLIT-INV-SW             PIC X(01).
009500         88  ORRORH-SPLIT-INV-NO             VALUE ' '.
009600         88  ORRORH-SPLIT-INV-YES            VALUE 'Y'.
009700     05  ORRORH-INTERNET-HOLD            PIC X(01).
009800**  BELOW FIELDS ARE USED FOR  CREDIT CARD ORDERS ***********
009900     05  ORRORH-CC-DATA.
010000         10  ORRORH-CALL-PRECALC-DATA.
010100             15  ORRORH-PAYMENT-CODE     PIC X(02).
010200             15  ORRORH-CARD-TYPE        PIC X(01).
010300         10  ORRORH-CREDIT-CARD-NO       PIC X(20).
010400         10  ORRORH-EXPIRATION-MONTH     PIC X(02).
010500         10  ORRORH-EXPIRATION-YEAR      PIC X(02).
010600         10  ORRORH-AUTH-CO-CODE         PIC X(03).
010700         10  ORRORH-SECURITY-CODE        PIC X(04).
010800         10  ORRORH-AUTHORIZE-CODE       PIC X(19).
010900         10  ORRORH-AUTHORIZED-AMT       PIC 9(13)V9(04).
011000*ROR0828310  ORRORH-FILLER-FOR-USE       PIC X(36).               PKV09266
011100* PLANNING TO DEFINE THESE BELOW FIELDS BY USING THIS NON-USED    PKV09266
011200*  FILLER AREA  INSIDE CC DATA AREA.  HAVE TO CHECK WITH EBS.     PKV09266
011300         10  ORRORH-FILLER-FOR-USE       PIC X(01).               PKV09266
011400         10  ORRORH-CAMPAIGN             PIC X(04).               PKV09266
011500         10  ORRORH-WAIVE-MINORD-FEE     PIC X(01).               PKV09266
011600         10  ORRORH-SER-NBR-REQ-SW       PIC X(01).               PKV09266
011700         10  ORRORH-VENDOR-CLAIM-NBR     PIC X(14).               PKV09266
011800         10  ORRORH-ECOD-AMT             PIC 9(13)V9(02).         PKV09266
011900*        10  ORRORH-LAST-NAME            PIC X(15).
012000*        10  ORRORH-FIRST-NAME-INITIAL   PIC X(01).
012100*        10  ORRORH-STREET-ADDRESS       PIC X(20).
012200         10  ORRORH-CITY                 PIC X(13).
012300         10  ORRORH-STATE                PIC X(02).
012400         10  ORRORH-ZIP                  PIC X(09).
012500**  END OF FIELDS USED FOR  CREDIT CARD ORDERS ***********
012600     05  ORRORH-CAPS-ID                  PIC X(04).
012700     05  ORRORH-CAPS-BUYER-NBR           PIC X(02).
012800     05  ORRORH-CAPS-PASSWORD            PIC X(08).
012900**  BELOW FIELDS ARE USED FOR  DIRECT SHIP ORDERS - WEB
013000     05  ORRORH-EU-DATA.
013100         10  ORRORH-CON-AGR-FLAG         PIC X(01).
013200         10  ORRORH-END-USER-ID          PIC X(10).
013300         10  ORRORH-EU-AGREEMENT-ID      PIC X(10).
013400         10  ORRORH-EU-CONTACT-ID        PIC X(10).
013500         10  ORRORH-EU-ADDRESS-ID        PIC X(10).
013600         10  ORRORH-EU-VEND-ORDR-CODE    PIC X(02).
013700     05  ORRORH-CONFIGURATION-FLAG       PIC X(01).               ROR07289
013800         88  ORRORH-CONFIGURATION-ORDER      VALUE 'Y'.           ROR07289
013900         88  ORRORH-NON-CONFIGURATION-ORDER  VALUE 'N'.           ROR07289
014000**  BELOW FIELDS ARE USED FOR INTERNAL USE IN DRIVER PROGRAM.     ROR07289
014100     05  ORRORH-INTERNAL-DATA.                                    ROR07289
014200         10  ORRORH-NEW-ORDER-SW         PIC X(01).               ROR07289
014300             88 ORRORH-NEW-ORDER             VALUE 'Y'.           ROR07289
014400             88 ORRORH-EXISTING-ORDER        VALUE 'N'.           ROR07289
014500         10  ORRORH-MORE-LINES-SW        PIC X(01).               ROR07289
014600             88 ORRORH-MORE-LINES-TO-COME    VALUE 'Y'.           ROR07289
014700             88 ORRORH-NO-MORE-LINES-TO-COME VALUE 'N'.           ROR07289
014800         10  ORRORH-INGRAM-ORDER-BR      PIC X(02).               ROR07289
014900         10  ORRORH-INGRAM-ORDER-NBR     PIC X(05).               ROR07289
015000         10  ORRORH-LAST-LINE-NBR        PIC X(03).               ROR07289
015100**  BELOW FIELDS ARE USED FOR  DIRECT SHIP ORDERS - NON WEB       ROR08283
015200     05  ORRORH-EU-DATA1.                                         ROR08283
015300         10  ORRORH-EUCNT-NAME           PIC X(30).               ROR08283
015400         10  ORRORH-EUCNT-PHONE          PIC X(15).               ROR08283
015500         10  ORRORH-EUCNT-EXT            PIC X(05).               ROR08283
015600         10  ORRORH-EUCNT-FAX            PIC X(15).               ROR08283
015700         10  ORRORH-EUCNT-CNTRY-CODE     PIC X(02).               ROR08283
015800         10  ORRORH-EU-COMPANY-NAME      PIC X(30).               ROR08283
015900         10  ORRORH-EU-COMPANY-VATNBR    PIC X(14).               ROR08283
016000         10  ORRORH-EU-AGREEMENT-ID1     PIC X(20).               ROR08283
016100         10  ORRORH-EU-PRICING-LVL-CD    PIC X(01).               ROR08283
016200     05  ORRORH-DUP-PO-SW                PIC X(01).               ROR08283
016300         88  ORRORH-DUP-PO-CHECK             VALUE 'C'.           ROR08283
016400         88  ORRORH-DUP-PO-OVERRIDE          VALUE 'O'.           ROR08283
016500**  END OF FIELDS USED FOR  DIRECT SHIP ORDERS - NON WEB****      ROR08283
016600     05  ORRORH-CC-DATA-CONT.                                     ROR08283
016700*  ADD BELOW MODIFIED  CC FIELDS - NEW.                           ROR08283
016800         10  ORRORH-CC-LAST-NAME         PIC X(25).               ROR08283
016900         10  ORRORH-CC-FIRST-NAME        PIC X(25).               ROR08283
017000         10  ORRORH-CC-STREET-ADDRESS    PIC X(32).               ROR08283
017100     05  ORRORH-CSN                      PIC X(17).               PKV09266
017200     05  ORRORH-CONT-ON-ERROR-SW         PIC X(01).               PKV09266
017300         88  ORRORH-CONT-ON-ERROR            VALUE 'Y'.           PKV09266
017400     05  ORRORH-ALT-ORDER-ENTRY-METHOD   PIC X(04).               ROR11194
017500     05  ORRORH-SHIP-CTAC-EMAIL          PIC X(95).               ROR15289
017600     05  ORRORH-QUOTE-NBR                PIC X(25).               ROR15289
017700     05  ORRORH-RSLR-CTAC-EMAIL          PIC X(95).               ROR15289
017800     05  ORRORH-SHIP-CTAC-PHONE          PIC X(15).               ROR15289
017900     05  ORRORH-VEND-AUTH-NUMBER         PIC X(16).               ROR15289
018000     05  ORRORH-EU-DATA-RAW-KEY-SW       PIC X(01).               PZD16064
018100     05  ORRORH-EU-PO-ID                 PIC X(20).               ROR16099
018200     05  ORRORH-SMS-NUMBER               PIC X(15).               DXB16281
018300     05  ORRORH-OPEN-WHSE-SEQ-FLAG       PIC X(01).               DXB16281
018400         88  ORRORH-USE-OPEN-WHSE-SEQ               VALUE 'Y'.    DXB16281
018500     05  ORRORH-UPS-AOD-SW               PIC X(01).               DXB16281
018600         88  OORORH-NO-ADULT-SIG-REQ                VALUE 'N'.    DXB16281
018700     05  ORRORH-DELI-NOTIF-EMAIL         PIC X(78).               DXB16309
018800     05  ORRORH-CUST-GROUP              PIC X(10).                VXA17111
018900     05  ORRORH-DV-FLAG                 PIC X(01).                VXA17111
019000     05  ORRORH-TRANSIT-DAYS            PIC 9(01).                VXA17111
019100     05  ORRORH-OMP-ORDER-NUMBER        PIC X(10).                FXS17217
019200     05  ORRORH-SIMULATED-ORDER-SW      PIC X(01).                TEH17279
019300     05  ORRORH-EMAIL-ADDRESS-EXTN      PIC X(28).                TEH17279
019400     05  ORRORH-FIRM-NAME               PIC X(50).                TEH17279
019500     05  ORRORH-US-CREDIT-CARD-SW       PIC X(01).                TEH17279
019600     05  ORRORH-CNFG-HDR-INFO-SW        PIC X(01).                NXC17279
019700         88  ORRORH-CNFG-HDR-INFO           VALUE 'Y'.            NXC17279
019800         88  ORRORH-CNFG-HDR-INSERTED       VALUE 'I'.            NXC17279
019900         88  ORRORH-CNFG-HDR-MODIFIED       VALUE 'M'.            NXC17279
020000         88  ORRORH-NO-CNFG-HDR-INFO        VALUE 'N'.            NXC17279
020100     05  ORRORH-OMP-ORDER-SW            PIC X(01).                TEH17279
020200         88  ORRORH-OMP-ORDER               VALUE 'Y'.            TEH17279
020100     05  ORRORH-RESIDENTIAL-SW          PIC X(01).                FXS18006
020200         88  ORRORH-RESIDENTIAL             VALUE 'R'.            FXS18006
020200         88  ORRORH-FIRM                    VALUE 'F'.            FXS18006
           05  ORRORH-EU-DEP-ID               PIC X(32).                ABM18097
           05  ORRORH-DEP-ORDER-NBR           PIC X(32).                ABM18097
           05  ORRORH-RSLR-G360-CTAC-NAME     PIC X(60).                JZP18097
           05  ORRORH-RSLR-G360-CTAC-NBR      PIC X(15).                JZP18097
           05  ORRORH-EU-SHIP-CTAC-NAME       PIC X(60).                JZP18097
           05  ORRORH-WEB-VR-HOLD-IND-SW      PIC X(01).                DXB18187
           05  ORRORH-WEB-WB-HOLD-IND-SW      PIC X(01).                DXB19067
           05  ORRORH-EU-LICENSE-ID           PIC X(10).                DXB19103
           05  ORRORH-FINALIZE-ONLY-SW        PIC X(01).                KXD19292
               88  ORRORH-FINALIZE-ONLY           VALUE 'Y'.            KXD19292
           05  ORRORH-NO-PRINT-SW             PIC X(01).                KXD19305
           05  ORRORH-CIG                     PIC X(10).                ROR20031
           05  ORRORH-CUP                     PIC X(15).                ROR20031
           05  ORRORH-SHIP-CTAC-EMAIL-IND     PIC X(01).                ROR20031
           05  ORRORH-RSLR-CTAC-EMAIL-IND     PIC X(01).                ROR20031
           05  ORRORH-VEND-MSA-ID             PIC X(20).                NXC20067
           05  ORRORH-TAX-CODE                PIC X(01).                VXA20067
           05  ORRORH-NP-ORDER-IND            PIC X(01).                MYM20067
               88  ORRORH-NP-ORDER-BACK-2-BACK    VALUE 'B'.            MYM20067
               88  ORRORH-NP-ORDER-REPLNISHMNT    VALUE 'R'.            MYM20067
           05  ORRORH-QUOTE-ID                PIC X(32).                NXC20067
           05  ORRORH-STATE-CODE              PIC X(02).                VYP20193
           05  ORRORH-ORDER-TYPE              PIC X(01).                PXM20193
           05  ORRORH-CARR-DESC               PIC X(12).                PXM20284
           05  ORRORH-DPAS-CODE               PIC X(02).                BYA21100
           05  ORRORH-EXPECTED-DELIVERY-DATE  PIC X(08).                BYA21100
           05  ORRORH-DPAS-PGM-ID             PIC X(02).                BYA21100
           05  ORRORH-PO-CONFIRM-FLAG         PIC X(01).                JZP21169
           05  ORRORH-SHIP-TO-CITY-NAME       PIC X(70).                VXA21261
           05  ORRORH-POSTSALE-HWLINK-IND     PIC X(01).                BYA23153
           05  ORRORH-CONTRACT-TYPE           PIC X(01).                NXC23153
           05  ORRORH-GLOBAL-LOC-NBR          PIC X(17).                AYB24152
           05  ORRORH-CUST-REF-NBR2           PIC X(20).                KXA24187
           05  ORRORH-EU-INFO-CMTS-SW        PIC X(01).                 MYR24250
               88  ORRORH-EU-INFO-CMTS            VALUE 'Y'.            MYR24250
           05  ORRORH-CONTRACT-NBR            PIC X(11).                AXZ24292
           05  ORRORH-FRT-EST-API-SW          PIC X(01).                VZM24313
           05  ORRORH-CISCO-ORD-SW            PIC X(01).                KXS25010
               88 ORRORH-CISCO-CCWR-ALL       VALUE 'R' 'C' 'B'.        KXS25010
               88 ORRORH-CISCO-CCWR           VALUE 'R'.                KXS25010
               88 ORRORH-CISCO-CCW            VALUE 'C'.                KXS25010
               88 ORRORH-CISCO-BOTH           VALUE 'B'.                KXS25010
           05  ORRORH-VENDOR-VMF-TYPE-SW      PIC X(01).                VZM25318
               88 ORRORH-DSMF-VENDOR          VALUE 'D'.                VZM25318
               88 ORRORH-LICENSING-VENDOR     VALUE 'L'.                VZM25318
           05  ORRORH-VND-VMF-HDR-INF-MISS-SW  PIC X(01).               VZM25318
               88 ORRORH-VND-VMF-HDR-INFO-MISS    VALUE 'Y'.            VZM25318
               88 ORRORH-VND-VMF-HDR-INFO-OK      VALUE 'N'.            VZM25318
               88 ORRORH-VND-VMF-HDR-INFO-NO-ACT  VALUE ' '.            VZM25318
           05  ORRORH-VND-VMF-HDR-INF-SENT-SW  PIC X(01).               VZM25346
               88 ORRORH-VND-VMF-HDR-INF-SENT     VALUE 'Y'.            VZM25346
           05  ORRORH-ORDER-FTZ-FLAG-SW        PIC X(01).               MZD26240
               88 ORRORH-ORDER-FTZ-FLAG           VALUE 'Y'.            MZD26240
           05  ORRORH-FILLER-AREA             PIC X(874).               MZD26240